## Upload the Data and Read the .csv File

In [76]:
# Importing Pandas Library
import pandas as pd

In [77]:
# Reading in Your Data
df = pd.read_csv('movie_scores.csv')

In [54]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00    m             8.00             10.00
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman 51.00    m              NaN               NaN
3      Oprah   Winfrey 66.00    f             6.00              8.00
4       Emma     Stone 31.00    f             7.00              9.00

# Check For Null

In [55]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [56]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [57]:
df['first_name']

0      Tom
1      NaN
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object

In [59]:
df[df['first_name'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
2       Hugh   Jackman 51.00   m              NaN               NaN
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [61]:
df[(df['pre_movie_score'].isnull()) & df['sex'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman 51.00   m              NaN               NaN

# Dropping NAN Values

In [78]:
# Drop nan values base on rows (axis=0)-->by default
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [79]:
# Drop nan values base on columns
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

# Filling NAN Values

In [18]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [19]:
# Filling nan value for the whole dataframe
df.fillna("NEW VALUE!")

,first_name,last_name,age,sex,pre_movie_score,post_movie_score
0,Tom,Hanks,63.0,m,8.0,10.0
1,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!
2,Hugh,Jackman,51.0,m,NEW VALUE!,NEW VALUE!
3,Oprah,Winfrey,66.0,f,6.0,8.0
4,Emma,Stone,31.0,f,7.0,9.0

In [20]:
# Filling nan value for a specific column
df['first_name'].fillna("Empty")

0      Tom
1    Empty
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object

In [21]:
# Filling nan value for a specific column in your data
df['first_name'] = df['first_name'].fillna("Empty")

In [22]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1      Empty       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [23]:
df['pre_movie_score'].mean()

7.0

In [24]:
# Filling nan value for a specific column using the mean of that same column
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [26]:
# Filling nan value for numerical columns in the data using their mean 
df[df.select_dtypes(include='number').columns] = df.select_dtypes(include='number').apply(lambda col: col.fillna(col.mean()))
df

  first_name last_name    age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.00    m              8.0              10.0
1      Empty       NaN  52.75  NaN              7.0               9.0
2       Hugh   Jackman  51.00    m              7.0               9.0
3      Oprah   Winfrey  66.00    f              6.0               8.0
4       Emma     Stone  31.00    f              7.0               9.0

# College Major Data

In [27]:
df = pd.read_csv('salaries_by_college_major.csv')

In [28]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

# Data Exploration and Data Cleaning

In [29]:
df.shape

(57, 6)

In [30]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [31]:
df.isna()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
5,False,False,False,False,False,False
6,False,False,False,False,False,False
7,False,False,False,False,False,False
8,False,False,False,False,False,False
9,False,True,True,True,True,True
10,False,False,False,False,False,False
11,False,False,False,False,False,False
12,False,False,False,False,False,False
13,False,False,False,False,False,False
14,False,False,False,False,False,False
15,False,True,True,True,True,False
16,False,False,False,False,False,False
17,False,False,False,False,False,False
18,False,False,False,False,False,False
19,False,False,False,False,False,False
20,False,False,False,False,False,False
21,False,False,False,False,False,False
22,False,False,False,False,False,False
23,False,False,False,False,False,False
24,False,False,False,False,False,False
25,False,False,False,False,False,False
26,False,False,False,False,False,False
27,True,False,False,False,True,True
28,False,False,False,False,False,False
29,False,False,False,False,False,False
30,False,False,False,False,False,False
31,False,False,False,False,False,False
32,False,False,False,False,False,False
33,False,True,True,False,True,False
34,False,False,False,False,False,False
35,False,False,False,False,False,False
36,False,False,False,False,False,False
37,False,False,False,False,False,False
38,False,False,False,False,False,False
39,False,False,False,False,False,False
40,False,False,False,False,False,False
41,False,False,False,False,False,False
42,True,True,False,True,True,False
43,False,False,False,False,False,False
44,False,False,False,False,False,False
45,True,False,True,True,False,False
46,False,False,False,False,False,False
47,False,False,False,False,False,False
48,False,False,False,False,False,False
49,False,False,False,False,False,False
50,False,False,False,False,False,False
51,False,False,False,False,False,False
52,False,False,False,False,False,False
53,False,False,False,False,False,False
54,False,False,False,False,False,False
55,False,False,False,False,False,False
56,False,True,True,True,True,True

In [32]:
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
52,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
53,Religion,34100.0,52000.0,29700.0,96400.0,HASS
54,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
55,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
56,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [33]:
clean_df = df.dropna()
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
51,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
52,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
53,Religion,34100.0,52000.0,29700.0,96400.0,HASS
54,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
55,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

# Accessing Columns and Individual Cells

In [34]:
clean_df['Starting Median Salary'].max()

74300.0

In [35]:
clean_df['Starting Median Salary'].idxmax()

49

In [38]:
clean_df['Starting Median Salary'][43]

57900.0

In [39]:
clean_df['Undergraduate Major'].loc[43]

'Mechanical Engineering'

In [40]:
clean_df['Undergraduate Major'][43]

'Mechanical Engineering'

In [41]:
clean_df.loc[43]

Undergraduate Major                  Mechanical Engineering
Starting Median Salary                              57900.0
Mid-Career Median Salary                            93600.0
Mid-Career 10th Percentile Salary                   63700.0
Mid-Career 90th Percentile Salary                  163000.0
Group                                                  STEM
Name: 43, dtype: object

# Highest and Lowest Earning Degrees

In [42]:
print(clean_df['Mid-Career Median Salary'].max())
print(f"Index for the max mid career salary: {clean_df['Mid-Career Median Salary'].idxmax()}")
clean_df['Undergraduate Major'][8]

107000.0
Index for the max mid career salary: 8

'Chemical Engineering'

In [43]:
print(clean_df['Starting Median Salary'].min())
clean_df['Undergraduate Major'].loc[clean_df['Starting Median Salary'].idxmin()]

34000.0

'Spanish'

In [44]:
clean_df.loc[clean_df['Mid-Career Median Salary'].idxmin()]

Undergraduate Major                  Education
Starting Median Salary                 34900.0
Mid-Career Median Salary               52000.0
Mid-Career 10th Percentile Salary      29300.0
Mid-Career 90th Percentile Salary     102000.0
Group                                     HASS
Name: 20, dtype: object

# Sorting Values & Adding Columns: Majors with the Most Potential vs Lowest Risk

In [45]:
# clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
# clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary'])
spread_col = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
clean_df.insert(1, 'Spread', spread_col)
clean_df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [46]:
low_risk = clean_df.sort_values('Spread')
low_risk[['Undergraduate Major', 'Spread']].head()

           Undergraduate Major   Spread
46                     Nursing  50700.0
49         Physician Assistant  57600.0
47                   Nutrition  65300.0
55                     Spanish  65400.0
30  Health Care Administration  66400.0

# Degrees with the Highest Potential

In [47]:
highest_potential = clean_df.sort_values('Mid-Career 90th Percentile Salary', ascending=False)
highest_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
19             Economics                           210000.0
24               Finance                           195000.0
8   Chemical Engineering                           194000.0
41                  Math                           183000.0
50               Physics                           178000.0

In [48]:
highest_spread = clean_df.sort_values('Spread', ascending=False)
highest_spread[['Undergraduate Major', 'Spread']].head()

   Undergraduate Major    Spread
19           Economics  159400.0
24             Finance  147800.0
41                Math  137800.0
40           Marketing  132900.0
48          Philosophy  132500.0

In [49]:
highest_spread = clean_df.sort_values('Mid-Career Median Salary', ascending=False)
highest_spread[['Undergraduate Major', 'Mid-Career Median Salary']].head()

       Undergraduate Major  Mid-Career Median Salary
8     Chemical Engineering                  107000.0
13    Computer Engineering                  105000.0
21  Electrical Engineering                  103000.0
1    Aerospace Engineering                  101000.0
19               Economics                   98600.0

# Grouping and Pivoting Data with Pandas

In [50]:
clean_df.groupby('Group').count()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16